# 기초데이터과학 (01분반)

## 04-1. 데이터 가공 part 2

### Acknowledgement
#### 이 자료는 다음 서적의 내용을 바탕으로 작성되었음

- 쉽게 배우는 파이썬 데이터 분석. 이지스 퍼블리싱

### 데이터 전처리 (data preprocessing)

- 주어진 데이터를 분석에 적합하게 가공하는 작업
  - 데이터 일부를 추출하거나
  - 데이터를 종류 별로 나누거나
  - 여러 데이터를 합치는 등의 과정

- 데이터 전처리를 통하여 원하는 대로 데이터를 가공할 수 있어야 목적에 맞게 데이터를 분석할 수 있음

- 데이터 가공에 사용되는 pandas 함수

|함수|기능|
|---|---|
|query( ) | 행 추출하기|
|df[ ] | 열(변수) 추출하기|
|df.loc[ ], df.iloc[ ] | 행/열 추출하기|
|sort_values( ) | 정렬하기|
|assign( ) | 변수 추가하기|
|groupby( ) | 집단별로 나누기|
|agg( ) | 통계치 구하기|
|merge( ) | 데이터 합치기(열)|
|concat( ) | 데이터 합치기(행)|

### 특정 데이터 행만 추출하기
- 데이터 중 일부 데이터만 뽑아서 분석하는 경우 특정 조건에 맞는 데이터를 추출하는 것이 필요

- 데이터 추출하기 예를 살펴보기 위해 exam.csv 파일의 데이터를 이용

In [1]:
import pandas as pd
exam = pd.read_csv('exam.csv')
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

- 20명의 학생의 math, english, science 점수 데이터이고 5개 반(nclass) 학생 데이터로 구분되어 있다는 것을 알 수 있음

#### 변수에 비교 연산자와 논리 연산자 등을 이용하여 조건에 맞는 행만 추출하기
- ==, !=, >, <, >=, <=
- | (or 조건)
- & (and 조건)
- in (포함)

In [2]:
exam.query('nclass == 1') # nclass의 값이 1인 행만 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [4]:
exam.query('nclass == 1 | nclass == 2') # nclass의 값이 1이거나 2인 행만 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25

In [7]:
exam.query('nclass != 1 & nclass != 5') # nclass의 값이 1과 5가 아닌 행만 추출

    id  nclass  math  english  science
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65

In [8]:
exam.query('math > 70') # math 변수 값이 70 초과인 행만 추출

    id  nclass  math  english  science
6    7       2    80       90       45
7    8       2    90       78       25
14  15       4    75       56       78
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [9]:
exam.query('nclass == 1 & math <= 50') # nclass 값이 1이면서 math 값이 50 이하인 행만 추출

   id  nclass  math  english  science
0   1       1    50       98       50
2   3       1    45       86       78
3   4       1    30       98       58

In [10]:
exam.query('nclass in [2, 3] & english > 90') # nclass 값이 2 또는 3이면서 english 값이 90 초과인 행만 추출

   id  nclass  math  english  science
8   9       3    20       98       15
9  10       3    50       98       45

- 문자열 값을 갖는 변수의 조건 설정
  - 전체 조건을 명시할 때 사용하는 따옴표와 변수의 문자열 값을 지정할 때 사용하는 따옴표를 서로 다르게 입력해야 함

In [11]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [12]:
df.query('state == "Ohio"') # state 값이 'Ohio'인 행만 추출

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [13]:
df.query("state == 'Nevada'")

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

#### 연습문제
1. exam 데이터에서 math, english, science 점수가 모두 60 이상인 데이터만 추출
2. exam 데이터에서 3반 학생 중 math, science 점수가 40 이하인 데이터만 추출

### 특정 데이터 열(변수)만 추출하기
- 데이터의 여러 변수 중 일부 관심 있는 변수만 추출하여 사용하는 경우

In [14]:
import pandas as pd

exam = pd.read_csv('exam.csv') 

exam['math'] # math 변수(열)만 추출

0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78
Name: math, dtype: int64

- 위의 경우 결과가 DataFrame이 아니라 Series 형태임
- DataFrame 형태를 유지하기 위해서는 [ ]를 한번 더 써줘야 함

In [15]:
exam[['math']]

    math
0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78

In [16]:
exam[['math', 'english']] # math와 english 변수 2개 열을 추출

    math  english
0     50       98
1     60       97
2     45       86
3     30       98
4     25       80
5     50       89
6     80       90
7     90       78
8     20       98
9     50       98
10    65       65
11    45       85
12    46       98
13    48       87
14    75       56
15    58       98
16    65       68
17    80       78
18    89       68
19    78       83

- 변수 제거하기: 특정 변수를 제외하고 나머지 모든 변수를 추출하는 경우
  - df.drop( ) 함수 이용

In [17]:
exam.drop(columns = 'math') # math 변수 제거

    id  nclass  english  science
0    1       1       98       50
1    2       1       97       60
2    3       1       86       78
3    4       1       98       58
4    5       2       80       65
5    6       2       89       98
6    7       2       90       45
7    8       2       78       25
8    9       3       98       15
9   10       3       98       45
10  11       3       65       65
11  12       3       85       32
12  13       4       98       65
13  14       4       87       12
14  15       4       56       78
15  16       4       98       65
16  17       5       68       98
17  18       5       78       90
18  19       5       68       87
19  20       5       83       58

In [19]:
exam.drop(columns = ['nclass', 'math']) # nclass, math 변수 제거

    id  english  science
0    1       98       50
1    2       97       60
2    3       86       78
3    4       98       58
4    5       80       65
5    6       89       98
6    7       90       45
7    8       78       25
8    9       98       15
9   10       98       45
10  11       65       65
11  12       85       32
12  13       98       65
13  14       87       12
14  15       56       78
15  16       98       65
16  17       68       98
17  18       78       90
18  19       68       87
19  20       83       58

- query( ) 함수와 [ ]  조합하여 조건에 맞는 일부 데이터 추출하기

In [20]:
exam.query('math >= 50')[['id', 'math']] # math 값이 50 이상인 행에서 id, math 변수만 추출

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

#### 연습문제
1. exam 데이터에서 4, 5반 학생의 english 값만 추출
2. exam 데이터에서 english 값이 70 이상인 학생의 math, science 값만 추출

### df.loc[ ], df.iloc[ ]을 이용하여 특정 행과 열 데이터 추출하기
- df.loc[ ]
  - DataFrame의 인덱스를 이용하여 행과 열을 추출할 수 있음
- df.iloc[ ]
   - 인덱스 번호를 지정하여 행과 열을 추출할 수 있음

- 차이점
|기능 | df.loc[ ] | df.iloc[ ]|
|---|---|---|
|행 추출 인덱스 | 문자열, 번호 | 번호|
|열 추출 인덱스 | 문자열 | 번호|
|조건 지정해서 행 추출 | O | X|
|연속된 행 추출 x:y| 이상:이하 | 이상:미만|

#### df.loc[ ] 사용 예

In [25]:
import pandas as pd

df = pd.DataFrame({'var1':[1, 2, 3],
                   'var2':[4, 5, 6]},
                   index=['kim', 'lee', 'park']) # index 매개변수를 이용하여 DataFrame에 인덱스 문자열 지정
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

- 인덱스 문자열을 지정하여 행 추출

In [26]:
df.loc[['kim']] # 인덱스 값이 'kim'인 행 추출

     var1  var2
kim     1     4

In [27]:
df.loc[['kim', 'lee']] # 인덱스 값이 'kim', 'lee'인 행 추출

     var1  var2
kim     1     4
lee     2     5

- 인덱스 문자열을 지정하여 열 추출

In [28]:
df.loc[['kim'], 'var1'] # 인덱스 값이 'kim'인 행에서 'var1' 변수 값 추출

kim    1
Name: var1, dtype: int64

In [29]:
df.loc[['lee', 'park'], 'var2'] # 인덱스 값이 'lee', 'park'인 행에서 'var2' 변수 값 추출

lee     5
park    6
Name: var2, dtype: int64

In [30]:
df.loc[:, 'var1'] # 모든 행에서 'var1' 변수 값 추출

kim     1
lee     2
park    3
Name: var1, dtype: int64

- 인덱스 번호를 지정하여 행 추출

In [31]:
import pandas as pd

exam = pd.read_csv('exam.csv') 

exam.loc[0] # 인덱스 번호가 0인 행 추출

id          1
nclass      1
math       50
english    98
science    50
Name: 0, dtype: int64

In [33]:
exam.loc[[0]] # 인덱스 번호가 0인 행 추출 (DataFrame 형태를 유지)

   id  nclass  math  english  science
0   1       1    50       98       50

In [34]:
exam.loc[[0, 1, 2]] # 인덱스 번호가 0, 1, 2인 행 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [35]:
exam.loc[0:3] # 인덱스 번호가 0부터 3인 행 추출 (0, 3 모두 포함)

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [36]:
exam.loc[15:] # 인덱스 번호가 15부터 마지막까지 행 추출

    id  nclass  math  english  science
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [38]:
exam.loc[:2] # 인덱스 번호가 처음부터 2까지 행 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

- 조건을 충족하는 행 추출

In [39]:
exam.loc[exam['nclass'] == 1] # exam의 'nclass' 변수 값이 1인 행 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [40]:
exam.loc[exam['math'] >= 70] # exam의 'math' 변수 값이 70 이상인 행 추출

    id  nclass  math  english  science
6    7       2    80       90       45
7    8       2    90       78       25
14  15       4    75       56       78
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [41]:
exam.loc[exam['nclass'] == 3, ['math', 'science']] # 'nclass' 변수 값이 3인 행에서 'math', 'science' 열 추출

    math  science
8     20       15
9     50       45
10    65       65
11    45       32

In [43]:
exam.loc[0:5, ['id','math']] # 인덱스 0부터 5까지 행에서 'id', 'math' 열 추출

   id  math
0   1    50
1   2    60
2   3    45
3   4    30
4   5    25
5   6    50

#### df.iloc[ ] 사용 예

- 인덱스 번호를 지정해 행 추출하기

In [44]:
exam.iloc[[0]]

   id  nclass  math  english  science
0   1       1    50       98       50

In [45]:
exam.iloc[[0, 5, 7]]

   id  nclass  math  english  science
0   1       1    50       98       50
5   6       2    50       89       98
7   8       2    90       78       25

In [46]:
exam.iloc[0:3] # 인덱스 번호 0부터 2까지 행 추출 (3 포함 안 됨)
# loc[ ]과 다른 부분

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78

In [48]:
exam.loc[0:3] # 인덱스 번호 0부터 3까지 행 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

- 인덱스 번호를 지정해 열 추출하기

In [49]:
exam.iloc[:, 1] # 모든 행의 1열 추출

0     1
1     1
2     1
3     1
4     2
5     2
6     2
7     2
8     3
9     3
10    3
11    3
12    4
13    4
14    4
15    4
16    5
17    5
18    5
19    5
Name: nclass, dtype: int64

In [50]:
exam.iloc[:, [1, 3]] # 모든 행의 1, 3열 추출

    nclass  english
0        1       98
1        1       97
2        1       86
3        1       98
4        2       80
5        2       89
6        2       90
7        2       78
8        3       98
9        3       98
10       3       65
11       3       85
12       4       98
13       4       87
14       4       56
15       4       98
16       5       68
17       5       78
18       5       68
19       5       83

In [51]:
exam.iloc[2, 3] # 2행의 3열 추출

86

In [52]:
exam.iloc[[0, 1], [0, 1, 2]] # 0, 1 행의 0, 1, 2 열 추출

   id  nclass  math
0   1       1    50
1   2       1    60

#### 연습문제
1. exam 데이터에서 loc[ ]을 이용하여 5반 학생의 english 값만 추출
2. exam 데이터에서 loc[ ]을 이용하여 english 값이 70 이상인 학생의 math, science 값만 추출

### 데이터 정렬하기
- df.sort_values( )
  - 기본적으로 오름차순 정렬

In [54]:
import pandas as pd

exam = pd.read_csv('exam.csv') 

exam.sort_values('math') # math 값 기준으로 오름차순 정렬

    id  nclass  math  english  science
8    9       3    20       98       15
4    5       2    25       80       65
3    4       1    30       98       58
2    3       1    45       86       78
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
0    1       1    50       98       50
9   10       3    50       98       45
5    6       2    50       89       98
15  16       4    58       98       65
1    2       1    60       97       60
10  11       3    65       65       65
16  17       5    65       68       98
14  15       4    75       56       78
19  20       5    78       83       58
6    7       2    80       90       45
17  18       5    80       78       90
18  19       5    89       68       87
7    8       2    90       78       25

- 내림차순 정렬

In [55]:
exam.sort_values('math', ascending = False) # 내림차순 정렬

    id  nclass  math  english  science
7    8       2    90       78       25
18  19       5    89       68       87
17  18       5    80       78       90
6    7       2    80       90       45
19  20       5    78       83       58
14  15       4    75       56       78
16  17       5    65       68       98
10  11       3    65       65       65
1    2       1    60       97       60
15  16       4    58       98       65
9   10       3    50       98       45
5    6       2    50       89       98
0    1       1    50       98       50
13  14       4    48       87       12
12  13       4    46       98       65
11  12       3    45       85       32
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
8    9       3    20       98       15

- 여러 정렬 기준 적용

In [56]:
exam.sort_values(['nclass', 'math']) # nclass 값으로 오름차순 정렬하고 거기서 math 값으로 오름차순 정렬

    id  nclass  math  english  science
3    4       1    30       98       58
2    3       1    45       86       78
0    1       1    50       98       50
1    2       1    60       97       60
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
11  12       3    45       85       32
9   10       3    50       98       45
10  11       3    65       65       65
12  13       4    46       98       65
13  14       4    48       87       12
15  16       4    58       98       65
14  15       4    75       56       78
16  17       5    65       68       98
19  20       5    78       83       58
17  18       5    80       78       90
18  19       5    89       68       87

In [57]:
exam.sort_values(['nclass', 'math'], ascending = [True, False]) # nclass 기준으로 오름차순 정렬하고 math 기준으로 내림차순 정렬

    id  nclass  math  english  science
1    2       1    60       97       60
0    1       1    50       98       50
2    3       1    45       86       78
3    4       1    30       98       58
7    8       2    90       78       25
6    7       2    80       90       45
5    6       2    50       89       98
4    5       2    25       80       65
10  11       3    65       65       65
9   10       3    50       98       45
11  12       3    45       85       32
8    9       3    20       98       15
14  15       4    75       56       78
15  16       4    58       98       65
13  14       4    48       87       12
12  13       4    46       98       65
18  19       5    89       68       87
17  18       5    80       78       90
19  20       5    78       83       58
16  17       5    65       68       98

#### 연습문제
1. exam 데이터에서 math 값이 50 이상인 행을 추출하고 여기서 nclass와 english 기준으로 오름차순 정렬